{
  "title": "المشاريع",
  "subtitle": "أشياء قمت ببنائها",
  "description": "إليك بعض مشاريعي الأخيرة التي تعرض مهاراتي وخبرتي",
  "filters": {
    "all": "جميع المشاريع",
    "fullstack": "Full Stack",
    "react": "React",
    "frontend": "واجهات أمامية",
    "early-works": "رحلتي في التعلم"
  },
  "buttons": {
    "viewLive": "عرض مباشر",
    "viewCode": "عرض الكود",
    "viewDetails": "عرض التفاصيل",
    "viewAll": "عرض جميع المشاريع"
  },
  "labels": {
    "featured": "مميز",
    "new": "جديد",
    "inProgress": "قيد التنفيذ",
    "completed": "مكتمل",
    "technologies": "التقنيات",
    "year": "السنة",
    "status": "الحالة"
  },
  "empty": {
    "title": "لم يتم العثور على مشاريع",
    "description": "جرب اختيار فلتر مختلف"
  },
  "taskManagement": {
    "title": "نظام إدارة المهام",
    "description": "تطبيق ويب متكامل للتعاون الجماعي يتميز بإدارة المشاريع والمهام، إشعارات فورية باستخدام SignalR، إرفاق الملفات، نظام التعليقات، ولوحة تحكم تفاعلية مع رسوم بيانية تحليلية."
  },
  "techbooksStore": {
    "title": "متجر الكتب التقنية",
    "description": "متجر كتب تقنية عصري مبني بـ React بحث فوري، سلة مشتريات، تسجيل دخول جوجل (Firebase)، تصميم متجاوب، وأداء فائق السرعة باستخدام LocalStorage. تجربة تسوق ممتعة وسلسة من البداية للنهاية."
  },
  "quizme": {
    "title": "اختبرني - تحدي المعرفة الإسلامية",
    "description": "تطبيق ويب تفاعلي عربي لاختبار المعرفة بالقرآن والأنبياء والصحابة من خلال بطاقات قلابة. يحتوي على أربع فئات رئيسية مع رسوم متحركة جميلة ودعم كامل للـ RTL."
  },
  "adviceGenerator": {
    "titlee": "مولّد النصائح العشوائية",
    "description": "تطبيق أنيق ومتجاوب يعرض نصيحة عشوائية جديدة عند كل ضغطة على زر النرد. يستخدم Advice Slip API مع تصميم متجاوب بالكامل."
  },
  "htmlTemplate03": {
    "titlee": "صفحة هبوط متجاوبة حديثة",
    "description": "landing page متجاوبة بالكامل مبنية بـ HTML و CSS تتميز بأقسام متحركة وتخطيطات مرنة باستخدام CSS Grid و Flexbox. تشمل شهادات، خدمات، مهارات، أحداث والمزيد."
  },
  "casperTemplate": {
    "titlee": "قالب Casper الإبداعي",
    "description": "قالب HTML/CSS متجاوب حديث مع تصميم دقيق البكسل. يتميز بواجهة نظيفة، توافق عبر المتصفحات، وكود خفيف بدون مكتبات غير ضرورية."
  },
  "recipePage": {
    "title": "Recipe Page",
    "description": "تحدٍ  من Frontend Mentor: صفحة وصفة طعام مُنفذة بـ HTML5 وCSS3 فقط. تركيز كامل على الـ Typography الجميلة، الـ Spacing الدقيق، التصميم المتجاوب (Mobile-First)، الـ Custom Properties، والـ Hover states الراقية."
  },
  "ageCalculator": {
    "title": "Age Calculator",
    "description": "تطبيق أنيق ومتجاوب لحساب العمر بدقة متناهية (سنوات/أشهر/أيام). يحتوي على نظام تحقق ذكي وفوري لكل الحقول. باستخدام Vanilla JavaScript وHTML/CSS فقط."
  },
  "perfumeCard": {
    "title": "Product Card",
    "description": "بطاقة عرض منتج فاخرة ومتجاوبة لعطر راقي . تتضمن تبديل الصورة تلقائيًا حسب الجهاز، وتصميم Mobile-First مُنفذ بـ HTML5 وCSS Flexbox فقط."
  }
}
